---
type: StructuralSectionSigmaProfile
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 4
tags: [revit-api, class]
---

# StructuralSectionSigmaProfile

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfile` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionSigmaProfile | 2016 | `public StructuralSectionSigmaProfile ( double width , double height , double wallNominalThickness , double wallDesignThickness , double innerFillet , double centroidHorizontal , double centroidVertical , double principal` |
| Property | BendWidth | 2016 | `public double BendWidth { get ; set ; }` |
| Property | MiddleBendLength | 2016 | `public double MiddleBendLength { get ; set ; }` |
| Property | TopBendLength | 2016 | `public double TopBendLength { get ; set ; }` |